; domain
(define (domain MultiRobotRunner)
(:requirements
    :typing
    :negative-preconditions
    :action-costs
)

(:types
    robot gridsquare direction
)

(:predicates
    ;Which robot at which location
    (robot-at ?r - robot ?loc - gridsquare)
    ;Which robot faces which direction
    (robot-facing ?r - robot ?d - direction)
    
    ;Obstacle at which location
    (obstacle-at ?loc - gridsquare)
    
    ;Grid square adjacent in particular direction
    (gridsquare-connected ?from ?to - gridsquare ?d - direction)
    ;Rotation adjacency
    (rotation-adjacent ?from ?to - direction)
    
    ;Which robot chooses action
    (turn ?r - robot)
    ;Which robot chooses action after a robot chooses action
    (next-turn ?r1 ?r2 - robot)
    (first-robot ?r - robot)
    (last-robot ?r - robot)
    
    ;Two phases (select action / perform action)
    (phase-select)
    (phase-apply)
    
    ;What the robot plan to do in this round (moveforward/rotate/wait)
    (planned-moveforward ?r - robot ?from ?to - gridsquare)
    (planned-rotate ?r - robot ?from ?to - direction)
    (planned-wait ?r - robot ?loc - gridsquare)
    
    ;Prevent Vertex Collision
    ;A location that the robot planned to stay for the next round
    (reserved-location ?loc - gridsquare)
    ;Prevent Edge (Swapping) Collision
    (reserved-edge ?from ?to - gridsquare)
    
    ; Mark robot has already selected action in this round
    (select-action-done ?r - robot)
    
    ; Mark the Goal location for a specific robot
    (goal-location ?r - robot ?loc - gridsquare)
)

(:functions
    (total-cost)
)

; ---------------------------
; SELECTION PHASE
; robots decide actions here
; ---------------------------

; choose moveforward (not last robot)
; only allowed if no obstacle and no collision conflict
(:action select-moveforward
    :parameters (?r - robot ?from ?to - gridsquare ?d - direction ?nxt - robot)
    :precondition (and
        (phase-select)
        (turn ?r)
        (not (last-robot ?r))
        (next-turn ?r ?nxt)
        (not (select-action-done ?r))

        (robot-at ?r ?from)
        (not (goal-location ?r ?from))
        (robot-facing ?r ?d)
        (gridsquare-connected ?from ?to ?d)
        (not (obstacle-at ?to))

        ; Avoid Vertex Collision
        (not (reserved-location ?to))

        ; Avoid Edge (Swapping) Collision
        (not (reserved-edge ?to ?from))
    )
    :effect (and
        (planned-moveforward ?r ?from ?to)
        (reserved-location ?to)
        (reserved-edge ?from ?to)
        (select-action-done ?r)
        (not (turn ?r))
        (turn ?nxt)
    )
 )

; choose rotate (not last robot)
; rotation stays in same cell, so also needs reservation
(:action select-rotate
    :parameters (?r - robot ?loc - gridsquare ?fromdir ?todir - direction ?nxt - robot)
    :precondition (and 
        (phase-select)
        (turn ?r)
        (not (last-robot ?r))
        (next-turn ?r ?nxt)
        (not (select-action-done ?r))
        
        (robot-at ?r ?loc)
        (not (goal-location ?r ?loc))
        (robot-facing ?r ?fromdir)
        (rotation-adjacent ?fromdir ?todir)
        
        (not (reserved-location ?loc))   
    )
    :effect (and 
        (planned-rotate ?r ?fromdir ?todir)
        (reserved-location ?loc)
        (select-action-done ?r)
        (not (turn ?r))
        (turn ?nxt)
    )
)

; choose wait (not last robot)
(:action select-wait
    :parameters (?r - robot ?loc - gridsquare ?nxt - robot)
    :precondition (and
        (phase-select)
        (turn ?r)
        (not (last-robot ?r))
        (next-turn ?r ?nxt)
        (not (select-action-done ?r))
        
        (robot-at ?r ?loc)
        
        (not (reserved-location ?loc))
    )
    :effect (and
        (planned-wait ?r ?loc)
        (reserved-location ?loc)
        (select-action-done ?r)
        (not (turn ?r))
        (turn ?nxt)
    )
)

; Last robot selects moveforward
; After the last robot selects, the domain switches
; from selection phase to apply phase
(:action select-moveforward-last-robot
    :parameters (?r - robot ?from ?to - gridsquare ?d - direction ?first - robot)
    :precondition (and
        (phase-select)
        (turn ?r)
        (last-robot ?r)
        (first-robot ?first)
        (not (select-action-done ?r))

        (robot-at ?r ?from)
        (not (goal-location ?r ?from))
        (robot-facing ?r ?d)
        (gridsquare-connected ?from ?to ?d)
        (not (obstacle-at ?to))

        (not (reserved-location ?to))
        (not (reserved-edge ?to ?from))
    )
    :effect (and
        (planned-moveforward ?r ?from ?to)
        (reserved-location ?to)
        (reserved-edge ?from ?to)
        (select-action-done ?r)

        (not (turn ?r))
        (not (phase-select))
        (phase-apply)
        (turn ?first)
    )
 )

; Last robot selects rotate
 (:action select-rotate-last-robot
    :parameters (?r - robot ?loc - gridsquare ?fromdir ?todir - direction ?first - robot)
    :precondition (and
        (phase-select)
        (turn ?r)
        (last-robot ?r)
        (first-robot ?first)
        (not (select-action-done ?r))

        (robot-at ?r ?loc)
        (not (goal-location ?r ?loc))
        (robot-facing ?r ?fromdir)
        (rotation-adjacent ?fromdir ?todir)

        (not (reserved-location ?loc))
    )
    :effect (and
        (planned-rotate ?r ?fromdir ?todir)
        (reserved-location ?loc)
        (select-action-done ?r)

        (not (turn ?r))
        (not (phase-select))
        (phase-apply)
        (turn ?first)
    )
)

; Last robot selects wait
(:action select-wait-last-robot
    :parameters (?r - robot ?loc - gridsquare ?first - robot)
    :precondition (and
        (phase-select)
        (turn ?r)
        (last-robot ?r)
        (first-robot ?first)
        (not (select-action-done ?r))

        (robot-at ?r ?loc)
        (not (reserved-location ?loc))
    )
    :effect (and
        (planned-wait ?r ?loc)
        (reserved-location ?loc)
        (select-action-done ?r)

        (not (turn ?r))
        (not (phase-select))
        (phase-apply)
        (turn ?first)
    )
)

; ---------------------------
; APPLY PHASE
; execute chosen actions
; ---------------------------

; apply moveforward
(:action apply-moveforward
    :parameters (?r - robot ?from ?to - gridsquare ?nxt - robot)
    :precondition (and
        (phase-apply)
        (turn ?r)
        (not (last-robot ?r))
        (next-turn ?r ?nxt)
    
        (planned-moveforward ?r ?from ?to)
        (robot-at ?r ?from)
        (reserved-location ?to)
        (reserved-edge ?from ?to)
        (select-action-done ?r)
    )
    :effect (and
        (not (robot-at ?r ?from))
        (robot-at ?r ?to)
    
        (not (planned-moveforward ?r ?from ?to))
        (not (reserved-location ?to))
        (not (reserved-edge ?from ?to))
        (not (select-action-done ?r))
    
        (not (turn ?r))
        (turn ?nxt)
        (increase (total-cost) 1)
    )
)
    
; apply rotate
(:action apply-rotate
    :parameters (?r - robot ?loc - gridsquare ?fromd ?tod - direction ?nxt - robot)
    :precondition (and
        (phase-apply)
        (turn ?r)
        (not (last-robot ?r))
        (next-turn ?r ?nxt)
    
        (planned-rotate ?r ?fromd ?tod)
        (robot-at ?r ?loc)
        (robot-facing ?r ?fromd)
        (reserved-location ?loc)
        (select-action-done ?r)
    )
    :effect (and
        (not (robot-facing ?r ?fromd))
        (robot-facing ?r ?tod)
    
        (not (planned-rotate ?r ?fromd ?tod))
        (not (reserved-location ?loc))
        (not (select-action-done ?r))
    
        (not (turn ?r))
        (turn ?nxt)
        (increase (total-cost) 2)
    )
)
    
; apply wait
(:action apply-wait
    :parameters (?r - robot ?loc - gridsquare ?nxt - robot)
    :precondition (and
        (phase-apply)
        (turn ?r)
        (not (last-robot ?r))
        (next-turn ?r ?nxt)
    
        (planned-wait ?r ?loc)
        (robot-at ?r ?loc)
        (reserved-location ?loc)
        (select-action-done ?r)
    )
    :effect (and
        (not (planned-wait ?r ?loc))
        (not (reserved-location ?loc))
        (not (select-action-done ?r))
    
        (not (turn ?r))
        (turn ?nxt)
        (increase (total-cost) 0)
    )
)

; APPLY PHASE - last robot
; after last robot applies, go back to SELECT phase
(:action apply-moveforward-last-robot
    :parameters (?r - robot ?from ?to - gridsquare ?first - robot)
    :precondition (and
        (phase-apply)
        (turn ?r)
        (last-robot ?r)
        (first-robot ?first)

        (planned-moveforward ?r ?from ?to)
        (robot-at ?r ?from)
        (reserved-location ?to)
        (reserved-edge ?from ?to)
        (select-action-done ?r)
    )
    :effect (and
        (not (robot-at ?r ?from))
        (robot-at ?r ?to)

        (not (planned-moveforward ?r ?from ?to))
        (not (reserved-location ?to))
        (not (reserved-edge ?from ?to))
        (not (select-action-done ?r))

        (not (turn ?r))
        (not (phase-apply))
        (phase-select)
        (turn ?first)
        (increase (total-cost) 1)
    )
)

(:action apply-rotate-last-robot
    :parameters (?r - robot ?loc - gridsquare ?fromd ?tod - direction ?first - robot)
    :precondition (and
        (phase-apply)
        (turn ?r)
        (last-robot ?r)
        (first-robot ?first)

        (planned-rotate ?r ?fromd ?tod)
        (robot-at ?r ?loc)
        (robot-facing ?r ?fromd)
        (reserved-location ?loc)
        (select-action-done ?r)
    )
    :effect (and
        (not (robot-facing ?r ?fromd))
        (robot-facing ?r ?tod)
    
        (not (planned-rotate ?r ?fromd ?tod))
        (not (reserved-location ?loc))
        (not (select-action-done ?r))

        (not (turn ?r))
        (not (phase-apply))
        (phase-select)
        (turn ?first)
        (increase (total-cost) 2)
    )
)

(:action apply-wait-last-robot
    :parameters (?r - robot ?loc - gridsquare ?first - robot)
    :precondition (and
        (phase-apply)
        (turn ?r)
        (last-robot ?r)
        (first-robot ?first)

        (planned-wait ?r ?loc)
        (robot-at ?r ?loc)
        (reserved-location ?loc)
        (select-action-done ?r)
    )   
    :effect (and
        (not (planned-wait ?r ?loc))
        (not (reserved-location ?loc))
        (not (select-action-done ?r))

        (not (turn ?r))
        (not (phase-apply))
        (phase-select)
        (turn ?first)
        (increase (total-cost) 0)
    )
)
)

; problem
;It is recommended that you install the misc-pddl-generators plugin 
;and then use the Network generator to create the graph
(define (problem p4-network)
    (:domain MultiRobotRunner)

    (:objects
        robot1 robot2 robot3 - robot

        g00 g01 g02
        g10 g11 g12
        g20 g21 g22 - gridsquare

        north east south west - direction
    )

    (:init
        ; Locations of Robots
        (robot-at robot1 g00)
        (robot-at robot2 g12)
        (robot-at robot3 g21)

        ; Robot rotations
        (robot-facing robot1 east)
        (robot-facing robot2 north)
        (robot-facing robot3 west)

        ; Goal locations
        (goal-location robot1 g11)
        (goal-location robot2 g00)
        (goal-location robot3 g01)

        ; Turn order
        (first-robot robot1)
        (last-robot robot3)
        (next-turn robot1 robot2)
        (next-turn robot2 robot3)

        ; Initial phase / turn
        (phase-select)
        (turn robot1)

        ; east
        (gridsquare-connected g00 g01 east)
        (gridsquare-connected g01 g02 east)
        (gridsquare-connected g10 g11 east)
        (gridsquare-connected g11 g12 east)
        (gridsquare-connected g20 g21 east)
        (gridsquare-connected g21 g22 east)

        ; west
        (gridsquare-connected g01 g00 west)
        (gridsquare-connected g02 g01 west)
        (gridsquare-connected g11 g10 west)
        (gridsquare-connected g12 g11 west)
        (gridsquare-connected g21 g20 west)
        (gridsquare-connected g22 g21 west)

        ; south
        (gridsquare-connected g00 g10 south)
        (gridsquare-connected g10 g20 south)
        (gridsquare-connected g01 g11 south)
        (gridsquare-connected g11 g21 south)
        (gridsquare-connected g02 g12 south)
        (gridsquare-connected g12 g22 south)

        ; north
        (gridsquare-connected g10 g00 north)
        (gridsquare-connected g20 g10 north)
        (gridsquare-connected g11 g01 north)
        (gridsquare-connected g21 g11 north)
        (gridsquare-connected g12 g02 north)
        (gridsquare-connected g22 g12 north)

        ; rotations
        (rotation-adjacent north east)
        (rotation-adjacent east south)
        (rotation-adjacent south west)
        (rotation-adjacent west north)

        (rotation-adjacent east north)
        (rotation-adjacent south east)
        (rotation-adjacent west south)
        (rotation-adjacent north west)

        (= (total-cost) 0)
    )

    (:goal
        (and
            (robot-at robot1 g11)
            (robot-at robot2 g00)
            (robot-at robot3 g01)
        )
    )

    (:metric minimize (total-cost))
)

; plan
1. (select-moveforward robot1 g00 g01 east robot2)
   deleted: (turn robot1)
   added: (planned-moveforward robot1 g00 g01) (reserved-location g01) (reserved-edge g00 g01) (select-action-done robot1) (turn robot2)
   goals met: 0 of 3
2. (select-moveforward robot2 g12 g02 north robot3)
   deleted: (turn robot2)
   added: (planned-moveforward robot2 g12 g02) (reserved-location g02) (reserved-edge g12 g02) (select-action-done robot2) (turn robot3)
   goals met: 0 of 3
3. (select-rotate-last-robot robot3 g21 west north robot1)
   deleted: (turn robot3) (phase-select)
   added: (planned-rotate robot3 west north) (reserved-location g21) (select-action-done robot3) (phase-apply) (turn robot1)
   goals met: 0 of 3
4. (apply-moveforward robot1 g00 g01 robot2)
   deleted: (robot-at robot1 g00) (planned-moveforward robot1 g00 g01) (reserved-location g01) (reserved-edge g00 g01) (select-action-done robot1) (turn robot1)
   added: (robot-at robot1 g01) (turn robot2)
   goals met: 0 of 3
5. (apply-moveforward robot2 g12 g02 robot3)
   deleted: (robot-at robot2 g12) (planned-moveforward robot2 g12 g02) (reserved-location g02) (reserved-edge g12 g02) (select-action-done robot2) (turn robot2)
   added: (robot-at robot2 g02) (turn robot3)
   goals met: 0 of 3
6. (apply-rotate-last-robot robot3 g21 west north robot1)
   deleted: (robot-facing robot3 west) (planned-rotate robot3 west north) (reserved-location g21) (select-action-done robot3) (turn robot3) (phase-apply)
   added: (robot-facing robot3 north) (phase-select) (turn robot1)
   goals met: 0 of 3
7. (select-rotate robot1 g01 east south robot2)
   deleted: (turn robot1)
   added: (planned-rotate robot1 east south) (reserved-location g01) (select-action-done robot1) (turn robot2)
   goals met: 0 of 3
8. (select-rotate robot2 g02 north east robot3)
   deleted: (turn robot2)
   added: (planned-rotate robot2 north east) (reserved-location g02) (select-action-done robot2) (turn robot3)
   goals met: 0 of 3
9. (select-moveforward-last-robot robot3 g21 g11 north robot1)
   deleted: (turn robot3) (phase-select)
   added: (planned-moveforward robot3 g21 g11) (reserved-location g11) (reserved-edge g21 g11) (select-action-done robot3) (phase-apply) (turn robot1)
   goals met: 0 of 3
10. (apply-rotate robot1 g01 east south robot2)
   deleted: (robot-facing robot1 east) (planned-rotate robot1 east south) (reserved-location g01) (select-action-done robot1) (turn robot1)
   added: (robot-facing robot1 south) (turn robot2)
   goals met: 0 of 3
11. (apply-rotate robot2 g02 north east robot3)
   deleted: (robot-facing robot2 north) (planned-rotate robot2 north east) (reserved-location g02) (select-action-done robot2) (turn robot2)
   added: (robot-facing robot2 east) (turn robot3)
   goals met: 0 of 3
12. (apply-moveforward-last-robot robot3 g21 g11 robot1)
   deleted: (robot-at robot3 g21) (planned-moveforward robot3 g21 g11) (reserved-location g11) (reserved-edge g21 g11) (select-action-done robot3) (turn robot3) (phase-apply)
   added: (robot-at robot3 g11) (phase-select) (turn robot1)
   goals met: 0 of 3
13. (select-rotate robot1 g01 south west robot2)
   deleted: (turn robot1)
   added: (planned-rotate robot1 south west) (reserved-location g01) (select-action-done robot1) (turn robot2)
   goals met: 0 of 3
14. (select-rotate robot2 g02 east south robot3)
   deleted: (turn robot2)
   added: (planned-rotate robot2 east south) (reserved-location g02) (select-action-done robot2) (turn robot3)
   goals met: 0 of 3
15. (select-rotate-last-robot robot3 g11 north east robot1)
   deleted: (turn robot3) (phase-select)
   added: (planned-rotate robot3 north east) (reserved-location g11) (select-action-done robot3) (phase-apply) (turn robot1)
   goals met: 0 of 3
16. (apply-rotate robot1 g01 south west robot2)
   deleted: (robot-facing robot1 south) (planned-rotate robot1 south west) (reserved-location g01) (select-action-done robot1) (turn robot1)
   added: (robot-facing robot1 west) (turn robot2)
   goals met: 0 of 3
17. (apply-rotate robot2 g02 east south robot3)
   deleted: (robot-facing robot2 east) (planned-rotate robot2 east south) (reserved-location g02) (select-action-done robot2) (turn robot2)
   added: (robot-facing robot2 south) (turn robot3)
   goals met: 0 of 3
18. (apply-rotate-last-robot robot3 g11 north east robot1)
   deleted: (robot-facing robot3 north) (planned-rotate robot3 north east) (reserved-location g11) (select-action-done robot3) (turn robot3) (phase-apply)
   added: (robot-facing robot3 east) (phase-select) (turn robot1)
   goals met: 0 of 3
19. (select-rotate robot1 g01 west south robot2)
   deleted: (turn robot1)
   added: (planned-rotate robot1 west south) (reserved-location g01) (select-action-done robot1) (turn robot2)
   goals met: 0 of 3
20. (select-rotate robot2 g02 south west robot3)
   deleted: (turn robot2)
   added: (planned-rotate robot2 south west) (reserved-location g02) (select-action-done robot2) (turn robot3)
   goals met: 0 of 3
21. (select-moveforward-last-robot robot3 g11 g12 east robot1)
   deleted: (turn robot3) (phase-select)
   added: (planned-moveforward robot3 g11 g12) (reserved-location g12) (reserved-edge g11 g12) (select-action-done robot3) (phase-apply) (turn robot1)
   goals met: 0 of 3
22. (apply-rotate robot1 g01 west south robot2)
   deleted: (robot-facing robot1 west) (planned-rotate robot1 west south) (reserved-location g01) (select-action-done robot1) (turn robot1)
   added: (robot-facing robot1 south) (turn robot2)
   goals met: 0 of 3
23. (apply-rotate robot2 g02 south west robot3)
   deleted: (robot-facing robot2 south) (planned-rotate robot2 south west) (reserved-location g02) (select-action-done robot2) (turn robot2)
   added: (robot-facing robot2 west) (turn robot3)
   goals met: 0 of 3
24. (apply-moveforward-last-robot robot3 g11 g12 robot1)
   deleted: (robot-at robot3 g11) (planned-moveforward robot3 g11 g12) (reserved-location g12) (reserved-edge g11 g12) (select-action-done robot3) (turn robot3) (phase-apply)
   added: (robot-at robot3 g12) (phase-select) (turn robot1)
   goals met: 0 of 3
25. (select-moveforward robot1 g01 g11 south robot2)
   deleted: (turn robot1)
   added: (planned-moveforward robot1 g01 g11) (reserved-location g11) (reserved-edge g01 g11) (select-action-done robot1) (turn robot2)
   goals met: 0 of 3
26. (select-moveforward robot2 g02 g01 west robot3)
   deleted: (turn robot2)
   added: (planned-moveforward robot2 g02 g01) (reserved-location g01) (reserved-edge g02 g01) (select-action-done robot2) (turn robot3)
   goals met: 0 of 3
27. (select-rotate-last-robot robot3 g12 east north robot1)
   deleted: (turn robot3) (phase-select)
   added: (planned-rotate robot3 east north) (reserved-location g12) (select-action-done robot3) (phase-apply) (turn robot1)
   goals met: 0 of 3
28. (apply-moveforward robot1 g01 g11 robot2)
   deleted: (robot-at robot1 g01) (planned-moveforward robot1 g01 g11) (reserved-location g11) (reserved-edge g01 g11) (select-action-done robot1) (turn robot1)
   added: (robot-at robot1 g11) (turn robot2)
   goals met: 1 of 3
29. (apply-moveforward robot2 g02 g01 robot3)
   deleted: (robot-at robot2 g02) (planned-moveforward robot2 g02 g01) (reserved-location g01) (reserved-edge g02 g01) (select-action-done robot2) (turn robot2)
   added: (robot-at robot2 g01) (turn robot3)
   goals met: 1 of 3
30. (apply-rotate-last-robot robot3 g12 east north robot1)
   deleted: (robot-facing robot3 east) (planned-rotate robot3 east north) (reserved-location g12) (select-action-done robot3) (turn robot3) (phase-apply)
   added: (robot-facing robot3 north) (phase-select) (turn robot1)
   goals met: 1 of 3
31. (select-wait robot1 g11 robot2)
   deleted: (turn robot1)
   added: (planned-wait robot1 g11) (reserved-location g11) (select-action-done robot1) (turn robot2)
   goals met: 1 of 3
32. (select-rotate robot2 g01 west north robot3)
   deleted: (turn robot2)
   added: (planned-rotate robot2 west north) (reserved-location g01) (select-action-done robot2) (turn robot3)
   goals met: 1 of 3
33. (select-moveforward-last-robot robot3 g12 g02 north robot1)
   deleted: (turn robot3) (phase-select)
   added: (planned-moveforward robot3 g12 g02) (reserved-location g02) (reserved-edge g12 g02) (select-action-done robot3) (phase-apply) (turn robot1)
   goals met: 1 of 3
34. (apply-wait robot1 g11 robot2)
   deleted: (planned-wait robot1 g11) (reserved-location g11) (select-action-done robot1) (turn robot1)
   added: (turn robot2)
   goals met: 1 of 3
35. (apply-rotate robot2 g01 west north robot3)
   deleted: (robot-facing robot2 west) (planned-rotate robot2 west north) (reserved-location g01) (select-action-done robot2) (turn robot2)
   added: (robot-facing robot2 north) (turn robot3)
   goals met: 1 of 3
36. (apply-moveforward-last-robot robot3 g12 g02 robot1)
   deleted: (robot-at robot3 g12) (planned-moveforward robot3 g12 g02) (reserved-location g02) (reserved-edge g12 g02) (select-action-done robot3) (turn robot3) (phase-apply)
   added: (robot-at robot3 g02) (phase-select) (turn robot1)
   goals met: 1 of 3
37. (select-wait robot1 g11 robot2)
   deleted: (turn robot1)
   added: (planned-wait robot1 g11) (reserved-location g11) (select-action-done robot1) (turn robot2)
   goals met: 1 of 3
38. (select-rotate robot2 g01 north west robot3)
   deleted: (turn robot2)
   added: (planned-rotate robot2 north west) (reserved-location g01) (select-action-done robot2) (turn robot3)
   goals met: 1 of 3
39. (select-rotate-last-robot robot3 g02 north west robot1)
   deleted: (turn robot3) (phase-select)
   added: (planned-rotate robot3 north west) (reserved-location g02) (select-action-done robot3) (phase-apply) (turn robot1)
   goals met: 1 of 3
40. (apply-wait robot1 g11 robot2)
   deleted: (planned-wait robot1 g11) (reserved-location g11) (select-action-done robot1) (turn robot1)
   added: (turn robot2)
   goals met: 1 of 3
41. (apply-rotate robot2 g01 north west robot3)
   deleted: (robot-facing robot2 north) (planned-rotate robot2 north west) (reserved-location g01) (select-action-done robot2) (turn robot2)
   added: (robot-facing robot2 west) (turn robot3)
   goals met: 1 of 3
42. (apply-rotate-last-robot robot3 g02 north west robot1)
   deleted: (robot-facing robot3 north) (planned-rotate robot3 north west) (reserved-location g02) (select-action-done robot3) (turn robot3) (phase-apply)
   added: (robot-facing robot3 west) (phase-select) (turn robot1)
   goals met: 1 of 3
43. (select-wait robot1 g11 robot2)
   deleted: (turn robot1)
   added: (planned-wait robot1 g11) (reserved-location g11) (select-action-done robot1) (turn robot2)
   goals met: 1 of 3
44. (select-moveforward robot2 g01 g00 west robot3)
   deleted: (turn robot2)
   added: (planned-moveforward robot2 g01 g00) (reserved-location g00) (reserved-edge g01 g00) (select-action-done robot2) (turn robot3)
   goals met: 1 of 3
45. (select-moveforward-last-robot robot3 g02 g01 west robot1)
   deleted: (turn robot3) (phase-select)
   added: (planned-moveforward robot3 g02 g01) (reserved-location g01) (reserved-edge g02 g01) (select-action-done robot3) (phase-apply) (turn robot1)
   goals met: 1 of 3
46. (apply-wait robot1 g11 robot2)
   deleted: (planned-wait robot1 g11) (reserved-location g11) (select-action-done robot1) (turn robot1)
   added: (turn robot2)
   goals met: 1 of 3
47. (apply-moveforward robot2 g01 g00 robot3)
   deleted: (robot-at robot2 g01) (planned-moveforward robot2 g01 g00) (reserved-location g00) (reserved-edge g01 g00) (select-action-done robot2) (turn robot2)
   added: (robot-at robot2 g00) (turn robot3)
   goals met: 2 of 3
48. (apply-moveforward-last-robot robot3 g02 g01 robot1)
   deleted: (robot-at robot3 g02) (planned-moveforward robot3 g02 g01) (reserved-location g01) (reserved-edge g02 g01) (select-action-done robot3) (turn robot3) (phase-apply)
   added: (robot-at robot3 g01) (phase-select) (turn robot1)
   goals met: 3 of 3
